MaiLangYang/mcu_project_template/firmware/cmsis/GD/GD32A7xx/Source/IAR/startup_gd32a72xx_m7_0.s
        PUBWEAK CPU_INT3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CPU_INT3_IRQHandler
        B CPU_INT3_IRQHandler

        PUBWEAK CAN0_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN0_WKUP_IRQHandler
        B CAN0_WKUP_IRQHandler

        PUBWEAK TIMER0_BRK_UP_TRG_CMT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER0_BRK_UP_TRG_CMT_IRQHandler
        B TIMER0_BRK_UP_TRG_CMT_IRQHandler

        PUBWEAK TIMER2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER2_IRQHandler
        B TIMER2_IRQHandler

        PUBWEAK TIMER1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER1_IRQHandler
        B TIMER1_IRQHandler

        PUBWEAK TIMER19_BRK_UP_TRG_CMT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER19_BRK_UP_TRG_CMT_IRQHandler
        B TIMER19_BRK_UP_TRG_CMT_IRQHandler

        PUBWEAK JDC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
JDC_IRQHandler
        B JDC_IRQHandler

        PUBWEAK I2C0_EV_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C0_EV_IRQHandler
        B I2C0_EV_IRQHandler

        PUBWEAK I2C0_ER_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C0_ER_IRQHandler
        B I2C0_ER_IRQHandler

        PUBWEAK I2C1_EV_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C1_EV_IRQHandler
        B I2C1_EV_IRQHandler

        PUBWEAK I2C1_ER_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C1_ER_IRQHandler
        B I2C1_ER_IRQHandler

        PUBWEAK SPI0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI0_IRQHandler
        B SPI0_IRQHandler

        PUBWEAK SPI1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI1_IRQHandler
        B SPI1_IRQHandler

        PUBWEAK USART0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USART0_IRQHandler
        B USART0_IRQHandler

        PUBWEAK USART1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USART1_IRQHandler
        B USART1_IRQHandler

        PUBWEAK USART2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USART2_IRQHandler
        B USART2_IRQHandler

        PUBWEAK EXTI10_15_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI10_15_IRQHandler
        B EXTI10_15_IRQHandler

        PUBWEAK EXTI5_9_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI5_9_IRQHandler
        B EXTI5_9_IRQHandler

        PUBWEAK TAMPER_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TAMPER_IRQHandler
        B TAMPER_IRQHandler

        PUBWEAK TIMER20_BRK_UP_TRG_CMT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER20_BRK_UP_TRG_CMT_IRQHandler
        B TIMER20_BRK_UP_TRG_CMT_IRQHandler

        PUBWEAK EXTI42_101_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI42_101_IRQHandler
        B EXTI42_101_IRQHandler

        PUBWEAK TIMER7_BRK_UP_TRG_CMT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER7_BRK_UP_TRG_CMT_IRQHandler
        B TIMER7_BRK_UP_TRG_CMT_IRQHandler

        PUBWEAK PLL_LOL_DES_RESET_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
PLL_LOL_DES_RESET_IRQHandler
        B PLL_LOL_DES_RESET_IRQHandler

        PUBWEAK DMAMUX_OVR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMAMUX_OVR_IRQHandler
        B DMAMUX_OVR_IRQHandler

        PUBWEAK FPU_WAB_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FPU_WAB_IRQHandler
        B FPU_WAB_IRQHandler

        PUBWEAK CMP0_EXTI_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CMP0_EXTI_IRQHandler
        B CMP0_EXTI_IRQHandler

        PUBWEAK CMP1_EXTI_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CMP1_EXTI_IRQHandler
        B CMP1_EXTI_IRQHandler

        PUBWEAK FMU_INIT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FMU_INIT_IRQHandler
        B FMU_INIT_IRQHandler

        PUBWEAK ADC1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ADC1_IRQHandler
        B ADC1_IRQHandler

        PUBWEAK ADC2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ADC2_IRQHandler
        B ADC2_IRQHandler

        PUBWEAK DAC0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DAC0_IRQHandler
        B DAC0_IRQHandler

        PUBWEAK STCM_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
STCM_IRQHandler
        B STCM_IRQHandler

        PUBWEAK DMA1_Channel0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel0_IRQHandler
        B DMA1_Channel0_IRQHandler

        PUBWEAK DMA1_Channel1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel1_IRQHandler
        B DMA1_Channel1_IRQHandler

        PUBWEAK DMA1_Channel2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel2_IRQHandler
        B DMA1_Channel2_IRQHandler

        PUBWEAK DMA1_Channel3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel3_IRQHandler
        B DMA1_Channel3_IRQHandler

        PUBWEAK DMA1_Channel4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_Channel4_IRQHandler
        B DMA1_Channel4_IRQHandler

        PUBWEAK WWDGT1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
WWDGT1_IRQHandler
        B WWDGT1_IRQHandler

        PUBWEAK CAN1_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN1_WKUP_IRQHandler
        B CAN1_WKUP_IRQHandler

        PUBWEAK CAN1_Message_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN1_Message_IRQHandler
        B CAN1_Message_IRQHandler

        PUBWEAK CAN1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN1_IRQHandler
        B CAN1_IRQHandler

        PUBWEAK CTI0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CTI0_IRQHandler
        B CTI0_IRQHandler

        PUBWEAK CTI1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CTI1_IRQHandler
        B CTI1_IRQHandler

        PUBWEAK CAN0_ECCERR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN0_ECCERR_IRQHandler
        B CAN0_ECCERR_IRQHandler

        PUBWEAK CAN1_ECCERR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN1_ECCERR_IRQHandler
        B CAN1_ECCERR_IRQHandler

        PUBWEAK CAN2_ECCERR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN2_ECCERR_IRQHandler
        B CAN2_ECCERR_IRQHandler

        PUBWEAK MFCOM_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
MFCOM_IRQHandler
        B MFCOM_IRQHandler

        PUBWEAK CMP0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CMP0_IRQHandler
        B CMP0_IRQHandler

        PUBWEAK CMP1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CMP1_IRQHandler
        B CMP1_IRQHandler

        PUBWEAK BUS_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
BUS_IRQHandler
        B BUS_IRQHandler

        PUBWEAK SENT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SENT_IRQHandler
        B SENT_IRQHandler

        PUBWEAK HWSEM_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HWSEM_IRQHandler
        B HWSEM_IRQHandler

        PUBWEAK CAN3_ECCERR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN3_ECCERR_IRQHandler
        B CAN3_ECCERR_IRQHandler

